# Author = Vishniakov Aleksandr Sergeevich
# Group = P3110
# Date = 15.10.2025
# Variant = 3

import pytest
from Informatics_Lab3_Task1 import task1

@pytest.mark.parametrize(
    ("text", "expected"),
    [
        (
            """Студент Вася вспомнил, что на своей лекции Балакшин П.В.
            упоминал про старшекурсников, которые будут ему помогать:
            Анищенко А.А., Машина Е.А. и Голованова-Иванова Д.В.""",
            ['Анищенко', 'Балакшин', 'Голованова-Иванова', 'Машина']
        ),
        (
            """В письме от 01.10.2025 Иван сообщил о переносе занятия.""",
            []
        ),
        (
            """Собрание проведут Петров-Сидоров С.С. и
            Сидорова А.В. в аудитории 101.""",
            ['Петров-Сидоров', 'Сидорова']
        ),
        (
            """Контакты ответственных: Абрамов А.А.,
            Яковлев Я.Я., Кузнецов К.К.""",
            ['Абрамов', 'Кузнецов', 'Яковлев']
        ),
        (
            """На защите присутствовали Орлов О.,
            Зайцев З.З.""",
            ['Зайцев', 'Орлов']
        ),
        (
            """Договор вчера подписал Смирнов - Александров С.С.
            по итогам встречи.""",
            ['Александров']
        ),
        (
            """ под руководством тов. Ежова Н.К.В.Д. достигла небывалых успехов в разоблачении контрреволюции.""",
            []
        ),

        (
            """ aaaa Петров А.-Б.Г воларыларл""",
            ['Петров']
        ),
    ]
)

def test_task1(text, expected):
    got = task1(text)
    assert expected == got
